using System;
using BenchmarkDotNet.Running;
using System.Collections.Generic;
using System.Text;

namespace Algorithms.Lesson_4
{
    class Program
    {
        // 2. Реализуйте двоичное дерево и метод вывода его в консоль
        // Реализуйте класс двоичного дерева поиска с операциями вставки, удаления, поиска.
        // Дерево должно быть сбалансированным(это требование не обязательно).
        // Также напишите метод вывода в консоль дерева, чтобы увидеть, насколько корректно работает ваша реализация.

        private static BinaryTree _tree;

        //static void Main(string[] args)
        //{
        //    _tree = new BinaryTree(10, 1, 11, 5, 6);
        //    _tree.Print();
        //    Console.WriteLine($"TreeHeight: {_tree.Height}");
        //    Console.WriteLine($"TreeWidth: {_tree.Width}");
        //}
    }
}
